---
kind: method
id: M:Autodesk.Revit.DB.FabricationPart.IsAHanger
source: html/71d0c529-a129-29c7-096b-6cb663597f73.htm
---
# Autodesk.Revit.DB.FabricationPart.IsAHanger Method

Checks whether it is a hanger.

## Syntax (C#)
```csharp
public bool IsAHanger()
```

## Returns
True if the part is a hanger. False otherwise.